tutorials/solidMechanics/immersedTauFastenerElasticSolidFoam/demo5/demoTauFastener5/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2800";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
91924
(
1360.87
821.599
482.247
314.335
234.361
196.971
179.099
170.14
...
)
;

boundaryField
{
    wall1
    {
        type            zeroGradient;
    }
    wall2
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 45;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1e-5;
    }
}


// ************************************************************************* //
