tutorials/solidMechanics/immersedTauFastenerElasticSolidFoam/demo5/demoTauFastener5/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "2e-08/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    wall1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6211;
        startFace       269192;
    }
    wall2
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3456;
        startFace       275403;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1876;
        startFace       278859;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1617;
        startFace       280735;
    }
)

// ************************************************************************* //
